/* automatically generated by rust-bindgen */

pub const ERFA_DPI: f64 = 3.141592653589793;
pub const ERFA_D2PI: f64 = 6.283185307179586;
pub const ERFA_DR2D: f64 = 57.29577951308232;
pub const ERFA_DR2AS: f64 = 206264.80624709636;
pub const ERFA_TURNAS: f64 = 1296000.0;
pub const ERFA_DTY: f64 = 365.242198781;
pub const ERFA_DAYSEC: f64 = 86400.0;
pub const ERFA_DJY: f64 = 365.25;
pub const ERFA_DJC: f64 = 36525.0;
pub const ERFA_DJM: f64 = 365250.0;
pub const ERFA_DJ00: f64 = 2451545.0;
pub const ERFA_DJM0: f64 = 2400000.5;
pub const ERFA_DJM00: f64 = 51544.5;
pub const ERFA_DJM77: f64 = 43144.0;
pub const ERFA_TTMTAI: f64 = 32.184;
pub const ERFA_CMPS: f64 = 299792458.0;
pub const ERFA_WGS84: u32 = 1;
pub const ERFA_GRS80: u32 = 2;
pub const ERFA_WGS72: u32 = 3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eraASTROM {
    pub pmt: f64,
    pub eb: [f64; 3usize],
    pub eh: [f64; 3usize],
    pub em: f64,
    pub v: [f64; 3usize],
    pub bm1: f64,
    pub bpn: [[f64; 3usize]; 3usize],
    pub along: f64,
    pub phi: f64,
    pub xpl: f64,
    pub ypl: f64,
    pub sphi: f64,
    pub cphi: f64,
    pub diurab: f64,
    pub eral: f64,
    pub refa: f64,
    pub refb: f64,
}
#[test]
fn bindgen_test_layout_eraASTROM() {
    assert_eq!(
        ::std::mem::size_of::<eraASTROM>(),
        248usize,
        concat!("Size of: ", stringify!(eraASTROM))
    );
    assert_eq!(
        ::std::mem::align_of::<eraASTROM>(),
        8usize,
        concat!("Alignment of ", stringify!(eraASTROM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).pmt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(pmt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).eb as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(eb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).eh as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(eh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).em as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(em)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).v as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).bm1 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(bm1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).bpn as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(bpn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).along as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(along)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).phi as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(phi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).xpl as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(xpl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).ypl as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(ypl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).sphi as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(sphi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).cphi as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(cphi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).diurab as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(diurab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).eral as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(eral)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).refa as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(refa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraASTROM>())).refb as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(eraASTROM),
            "::",
            stringify!(refb)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eraLDBODY {
    pub bm: f64,
    pub dl: f64,
    pub pv: [[f64; 3usize]; 2usize],
}
#[test]
fn bindgen_test_layout_eraLDBODY() {
    assert_eq!(
        ::std::mem::size_of::<eraLDBODY>(),
        64usize,
        concat!("Size of: ", stringify!(eraLDBODY))
    );
    assert_eq!(
        ::std::mem::align_of::<eraLDBODY>(),
        8usize,
        concat!("Alignment of ", stringify!(eraLDBODY))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraLDBODY>())).bm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(eraLDBODY),
            "::",
            stringify!(bm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraLDBODY>())).dl as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(eraLDBODY),
            "::",
            stringify!(dl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eraLDBODY>())).pv as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(eraLDBODY),
            "::",
            stringify!(pv)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_eraCal2jd"]
    pub fn eraCal2jd(
        iy: ::std::os::raw::c_int,
        im: ::std::os::raw::c_int,
        id: ::std::os::raw::c_int,
        djm0: *mut f64,
        djm: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_eraEpb"]
    pub fn eraEpb(dj1: f64, dj2: f64) -> f64;
}
extern "C" {
    #[link_name = "\u{1}_eraEpb2jd"]
    pub fn eraEpb2jd(epb: f64, djm0: *mut f64, djm: *mut f64);
}
extern "C" {
    #[link_name = "\u{1}_eraEpj"]
    pub fn eraEpj(dj1: f64, dj2: f64) -> f64;
}
extern "C" {
    #[link_name = "\u{1}_eraEpj2jd"]
    pub fn eraEpj2jd(epj: f64, djm0: *mut f64, djm: *mut f64);
}
extern "C" {
    #[link_name = "\u{1}_eraJd2cal"]
    pub fn eraJd2cal(
        dj1: f64,
        dj2: f64,
        iy: *mut ::std::os::raw::c_int,
        im: *mut ::std::os::raw::c_int,
